Tekla.Structures.Model.LoftedPlate
This class represents a lofted plate
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
private static List<ICurve> GetPlateBaseGeometries()
{
var bottomArc = new Arc(new Point(0, 0, 0), new Point(1000, 0, 0), new Vector(0, 0, 1), Math.PI);
var topArc = new Arc(new Point(0, 0, 10000), new Point(1000, 0, 10000), new Vector(0, 0, 1), Math.PI);
return new List<ICurve> { bottomArc, topArc };
}
public static void Example1()
{
var baseCurves = GetPlateBaseGeometries();
var loftedPlate = new LoftedPlate
{
BaseCurves = baseCurves,
Finish = "FOO"
};
loftedPlate.Profile.ProfileString = "PL10";
loftedPlate.Material.MaterialString = "Steel_Undefined";
loftedPlate.Insert();
new Model().CommitChanges();
}
}

Tekla.Structures.Model.LoftedPlate.#ctor
Initializes a new instance of the Tekla.Structures.Model.LoftedPlate class.

Tekla.Structures.Model.LoftedPlate.baseCurves


Tekla.Structures.Model.LoftedPlate.BaseCurves
The curves that define the directrix lines of the lofted plate. A lofted plate is defined by at least to
base curves (non empty if they are Polycurve(s)).
Remarks:
Only the first two curves will be used for the plate. Additionally, if the base curves are polycurves, only
the first geometry of each polycurve will be used.

Tekla.Structures.Model.LoftedPlate.FaceType
Gets or sets what type of solid faces will be used to create lofted plate solid.

Tekla.Structures.Model.LoftedPlate.Insert
Inserts the lofted plate into the model database. All the attributes must be set and there must be at
minimum 2 base curves.
Throws Tekla.Structures.Model.LoftedPlateOperationException:
Thrown if the input base curves would yield an invalid lofted plate. The most derived type of the exception
can be used to retrieve the actual source of error.
Returns: True on success.

Tekla.Structures.Model.LoftedPlate.Select
Selects a lofted plate object from the database.
Returns: True if success

Tekla.Structures.Model.LoftedPlate.Delete
Deletes the lofted plate with this instance identifier from the model database.
Returns: True on success.

Tekla.Structures.Model.LoftedPlate.Modify
Modifies the lofted plate object values in the database.
Throws Tekla.Structures.Model.LoftedPlateOperationException:
Thrown if the input base curves would yield an invalid lofted plate. The most derived type of the exception
can be used to retrieve the actual source of error.
Returns: True if success

Tekla.Structures.Model.LoftedPlate.ToStruct(Tekla.Structures.ModelInternal.dotPart_t@)
Exports this to marshaling struct
p: the export struct

Tekla.Structures.Model.LoftedPlate.FromPolycurve(Tekla.Structures.Geometry3d.Polycurve)
Gets the a base curve from the given polycurve
baseCurve: Input polycurve, from Core
Returns: ICurve that represents the base curve best

Tekla.Structures.Model.LoftedPlate.CheckParameterCorrectness
Examines whether lofted plate parameters are well defined

Tekla.Structures.Model.LoftedPlate.SetNeutralPositioning
Sets neutral positioning attributes

Tekla.Structures.Model.LoftedPlate.SelectInstance
Selects an instance of a lofted plate
Returns: True if success

Tekla.Structures.Model.LoftedPlate.CreateInstance
Creates an instance of a lofted plate
Returns: True if success

Tekla.Structures.Model.LoftedPlate.ModifyInstance
Modifies an instance of a lofted plate
Returns: True if success

Tekla.Structures.Model.LoftedPlate.ValidateOperationStatus(Tekla.Structures.ModelInternal.LoftedPlateValidityStatus)
Checks the error code of a lofted plate operation and throws the corresponding exception, if needed
status: Error code to check